In [16]:
import pandas as pd
import numpy as np

In [3]:
dict1 = {
    "name":["Rahul", "Jaggi", "Billa"],
    "Marks":[50, 90, 60],
    "City":["Delhi", "Chandigarh", "Amritsar"]
}

In [7]:
df = pd.DataFrame(dict1)
df

    name  Marks        City
0  Rahul     50       Delhi
1  Jaggi     90  Chandigarh
2  Billa     60    Amritsar

In [17]:
pd.Series(np.random.rand(10))

0    0.376842
1    0.855795
2    0.981604
3    0.724190
4    0.801275
5    0.279864
6    0.061728
7    0.552559
8    0.172018
9    0.376342
dtype: float64